[
  {
    "path": "posts/2021-06-07_ssc2021/",
    "title": "My first Statistical Society of Canada Annual Meeting",
    "description": "Notes and links from SSC2021. I often find I get the most from conferences if I take notes with the vague notion of sharing them. So this is mostly for me, but I hope it might be of interest to others, too. Note: This post will be updated sporadically.",
    "author": [
      {
        "name": "Liza Bolton",
        "url": {}
      }
    ],
    "date": "2021-06-07",
    "categories": [],
    "contents": "\n\nContents\nTalks you should go to (very biased recommendations)\nIndependent Summer Statistics Community (ISSC): Building a sustainable online undergraduate student community with Cocurricular Activities and Experiential Learning Opportunities\nThe Development and Implementation of a Toolkit for Learning R at all Levels.\n\nTalk notes\nInvited Presidential Address: Probability, Statistics, and Murder\nData privacy in official statistics (Panel Session)\nmverse: An R Library for Teaching and Conducting Multiverse Analysis\nIndependent Summer Statistics Community (ISSC): Building a sustainable online undergraduate student community with Cocurricular Activities and Experiential Learning Opportunities\nOnline Homework Impact in an Introductory Statistics Course\nTactile Response Experimental Analysis Toolkit (TREAT)\n\nReading list\nBooks\nArticles\n\n\n My SSC profile\nTalks you should go to (very biased recommendations)\nIndependent Summer Statistics Community (ISSC): Building a sustainable online undergraduate student community with Cocurricular Activities and Experiential Learning Opportunities\n 1:45 PM - 2:00 PM EDT on Monday, June 7\n Event link\n Nathalie Moon\nAbstract\nIn response to disruptions to our students’ plans due to COVID-19 and widespread feelings of isolation, we built a virtual community to help our students build portfolios, meet peers, and explore careers. In all, over 700 students in our programs signed up, and among the 164 students who responded to our end-of-summer survey, 41% were active and 48% passive participants; our data suggests that even passive participation was beneficial in making students feel more connected. As part of the ISSC, we held formal and informal data science workshops, social events, and career-building activities culminating in a DataFest COVID-19 Virtual Challenge. In all, 92 eligible teams applied to participate in DataFest, 62 were invited to compete, and 42 submitted complete submissions. In this talk, we will outline the principles guiding how the ISSC was structured including practical advice and tips for building a sustainable community, lessons learned, and plans for 2021.\nRésumé\nEn réponse aux perturbations des plans des élèves en raison de la COVID-19 et au sentiment d’isolement généralisé, nous avons créé une communauté virtuelle pour aider les étudiants à monter leur portfolio, à rencontrer leurs pairs et à découvrir des carrières. En tout, plus de 700 étudiants se sont inscrits à nos programmes et, parmi les 164 étudiants qui ont répondu à notre enquête de fin d’été, 41 % étaient des participants actifs et 48 % des participants passifs. Nos données suggèrent que même la participation passive a été bénéfique en donnant aux étudiants le sentiment d’être plus connectés. Dans le cadre de la Communauté statistique indépendante d’été, nous avons organisé des ateliers formels et informels sur les sciences des données, des événements sociaux et des activités de développement de carrière, qui ont débouché au défi virtuel des données DataFest COVID-19. Au total, 92 équipes admissibles ont posé leur candidature pour participer à ce défi, 62 ont été invitées à concourir et 42 ont soumis des dossiers complets. Dans cet exposé, nous présenterons les principes qui ont guidé la structure de la Communauté statistique indépendante d’été, les conseils pratiques et les astuces qui ont contribué à créer une communauté durable, ainsi que les leçons apprises et nos plans pour 2021.\nThe Development and Implementation of a Toolkit for Learning R at all Levels.\n 3:45 PM - 4:00 PM EDT on Wednesday, June 9\n Event link\n Samantha-Jo Caetano\nAbstract\nStatistics and data science have become ubiquitous in the hard and social sciences. When working with large data or complex methodology it is crucial that the data analysts are able to program. R is a statistical programming language that is free and popular in the statistics community. R works well for data visualizations, wrangling and employing simple to complex methodology. As educators in statistics we noticed a variation of programming backgrounds in our senior students. Our team of 7 undergraduate students, 2 graduate students, and 2 assistant professors have developed a toolkit to help students improve their programming in R. The toolkit is a set of interactive modules that students complete autonomously. The modules start from the very basics of installing R to tidyverse to employing Bayesian methods. In this talk, we will outline the development and uses of this toolkit, and highlight some next steps.\nRésumé\nLes statistiques et les sciences des données sont devenues omniprésentes dans les sciences dures et humaines. En travaillant avec des données volumineuses ou des méthodologies complexes, il est primordial que les analystes de données soient capables de programmer. R est un langage de programmation gratuit et populaire au sein de la communauté statistique. Il fonctionne à merveille pour les visualisations de données, leur préparation préalable et l’adoption de méthodologies simples ou complexes. En tant qu’éducateurs en statistique, nous avons remarqué que les formations en programmation varient parmi nos étudiants de cycle supérieur. Notre équipe de sept étudiants de premier cycle, deux étudiants de cycle supérieur et deux professeurs assistants ont conçu une boîte à outils afin d’aider les étudiants à rehausser leurs aptitudes de programmation en R. La boîte à outils est composée d’un ensemble de modules interactifs que les étudiants terminent de façon autonome. Les modules commencent par la base de l’installation de R, puis progressent vers tidyverse jusqu’à l’emploi de méthodes bayésiennes. Lors de cet exposé, nous décrirons les grandes lignes du développement et de l’utilisation de cette boîte à outils, et soulignerons les étapes à venir.\nTalk notes\nNotes and reflections of varying quality from the talks I attended + resources shared.\nNote: If I’ve written about talk and there is anything you’d like me to correct or add, please just let me know! Twitter/email links in the navigation bar.\nInvited Presidential Address: Probability, Statistics, and Murder\n Jeffrey Rosenthal,  @ProbabilityProf\nJeff took us on a journey through his experiences with media and especially as an expert witness in court cases. There are a mish-mash of links below and much more on his website: http://probability.ca.\nAn example of a case that was especially interesting/surprising was when he was an expert witness in a case about a marijuana grow-op. This story was really neat because significant jail time rests on whether or not the number of plants was more or less than 500. More than 500 leads to a mandatory three-year jail term.\nThe level of aggressive attacks you end up facing as a expert witness sounds extremely off-putting! I’m glad Jeff’s skin is think enough to go out and do this kind of work, because mine certainly is not.\nSome of Jeff’s final notes and advice:\nStatisticians are nicer, especially Canadian ones.\nBe cautious about what consulting work you agree to, especially in an adversarial context.\nYou can get paid a lot. Think about whether you want to you negotiate an hourly or fixed rate.\nThere are lots of satisfying/important aspects, but also lots of annoying/unpleasant ones, too.\n“If we statisticians don’t do it, then who will?”\nLinks\nHere are several links that were referred to during that talk or shared in chat. (Not exhaustive.)\nLottery link: http://probability.ca/lotteryscandal/\nAnnals Quadfecta: https://imstat.org/2021/05/14/the-annals-quadfecta-23/\nJeff’s Canadian Supreme Court opinion writing article: http://probability.ca/jeff/ftpdir/SCC_UTLJ.pdf\nDiscussion of SIDS/SUDI case history: https://en.wikipedia.org/wiki/Sally_Clark\n“The Clark case has its Aussie version that continues as Jeff speaks.” - Grace Chiu https://www.seattletimes.com/seattle-news/health/australian-mom-convicted-of-killing-4-children-seeks-pardon/\n\nwww.probability.ca/justice\nData privacy in official statistics (Panel Session)\n Donald Estep, Canadian Statistical Sciences Institute and Simon Fraser University,  @donestep1\n Natalie Shlomo, University of Manchester\n John Eltinge, US Census Bureau\n Anne-Sophie Charest, Université Laval\n Pierre Desrochers, Statistics Canada\nPeople don necessarily understand what their own views on disclosure/privacy look like mathematically.\nWhat is inference vs what is disclosure.\nUniqueness: if you publish something that is unique to one person, that is disclosure and that is fairly well agreed upon. BUT, what about as is scales up? What features makes these different, in context?\nWhat ‘privacy’ is interpreted as is context dependent, and expressed through jurisdictional law.\nSynthetic data generates new data by random draws from preditice models.\nDifferential privacy is a “pertubation tool”, a way to add noise/misclassify probabilistically.\nA wider ethical consider in this area is the question of which predictions are intrusions in unacceptable ways. This is more of an ethical/philosophical. When should we not make inferences?\nHow can we learn from others who have been doing risk communication (e.g., around health) to improve our own practices in official statistics\nMy background is using official statistics for social and health research in Aotearoa New Zealand, so it was excellent to dip a toe back into this world and hear about the context here.\nBig thanks to CANSSI for supporting this panel.  @CANSSIINCASS\nLinks\nDuncan, George & Keller-McNulty, Sallie & Stokes, Lynne. (2001). Disclosure Risk vs. Data Utility: The RU Confidentiality Map. https://www.researchgate.net/publication/245939728_Disclosure_Risk_vs_Data_Utility_The_RU_Confidentiality_Map\nKaloskampis. (2019). Synthetic data for public good. https://datasciencecampus.ons.gov.uk/projects/synthetic-data-for-public-good/\nNear, Darais & Boeckl. (2020). Differential Privacy for Privacy-Preserving Data Analysis: An Introduction to our Blog Series. https://www.nist.gov/blogs/cybersecurity-insights/differential-privacy-privacy-preserving-data-analysis-introduction-our\nmverse: An R Library for Teaching and Conducting Multiverse Analysis\n Michael Moon, University of Toronto,  @micbonmoon\nMotivating example, you’ll get different conclusions based on the choice to keep or remove an outlier when investigating hurricane names and people’s response (question: do people take hurricane’s less seriously if they have a feminine name?).\nFamiliar verbs from dplyr, removes need to do a bunch of error prone copy and pasting (systematic).\nInteractive modules are being developed by the team. Great demo of a Shiny app for playing with the hurricane data.\nSubmitting to CRAN sometime this summer.\nGreat presentation from Michael, and I’m super excited about playing with this package!\nLinks\nSlides: http://www.utstat.utoronto.ca/~moon/mverse-ssc21/#1\nPackage on GitHub: https://github.com/mverseanalysis/mverse\nSteegen S, Tuerlinckx F, Gelman A, Vanpaemel W. Increasing Transparency Through a Multiverse Analysis. Perspectives on Psychological Science. 2016;11(5):702-712. doi:10.1177/1745691616658637 https://journals.sagepub.com/doi/10.1177/1745691616658637\nIndependent Summer Statistics Community (ISSC): Building a sustainable online undergraduate student community with Cocurricular Activities and Experiential Learning Opportunities\n Nathalie Moon, University of Toronto\nI was part of the ISSC team, so not notes, other than I think Nathalie did a fab job explaining it.\nUnofficial list of Canadian universities doing ASA DataFest: U of T, UBC, Waterloo, MacEwan/University of Alberta — we should all be friends!\nLinks\nSlides\n2020 TidyTuesday activities on GitHub: https://github.com/elb0/ISSC\nOnline Homework Impact in an Introductory Statistics Course\n Tharshanna Nadarajah, University of Toronto\nNeat intro to MyOpenMath advantages and how Tharshanna has used it in teaching, student response and outcomes.\nLinks\nMyOpenMath: https://www.myopenmath.com\nTactile Response Experimental Analysis Toolkit (TREAT)\n Sohee Kang, University of Toronto\nSome lovely data collection activities that students can do in class from a phone or computer. Love this from the abstract: “Students often feel disengaged with data that they do not perceive as being”real\" or “authentic”, and it is important that they believe that the data they are analyzing is representative of real-world problems.\"\nLinks\nMovement breaks that can be used in experiments https://ocw.utoronto.ca/movement-breaks/\nReading list\nBooks\n Goodreads shelf for SSC2021\nKnock on Wood: Luck, Chance, and the Meaning of Everything by Jeffrey S. Rosenthal https://www.goodreads.com/book/show/36300756-knock-on-wood\nArticles\nJeff’s Canadian Supreme Court opinion writing article: http://probability.ca/jeff/ftpdir/SCC_UTLJ.pdf\nKaloskampis. (2019). Synthetic data for public good. https://datasciencecampus.ons.gov.uk/projects/synthetic-data-for-public-good/\nSteegen S, Tuerlinckx F, Gelman A, Vanpaemel W. Increasing Transparency Through a Multiverse Analysis. Perspectives on Psychological Science. 2016;11(5):702-712. doi:10.1177/1745691616658637 https://journals.sagepub.com/doi/10.1177/1745691616658637\n\n\n\n",
    "preview": {},
    "last_modified": "2021-06-07T14:48:01-04:00",
    "input_file": {}
  }
]
