[
  {
    "path": "posts/2022-02-04-learnr-interactives-or-how-i-learned-to-stop-worrying-and-turn-my-students-into-pixelated-farmers/",
    "title": "`learnr` Interactives or: How I Learned to Stop Worrying and Turn my Students into Pixelated Farmers",
    "description": "Slides and image descriptions from my part of the CDS education COP.",
    "author": [
      {
        "name": "Liza Bolton",
        "url": {}
      }
    ],
    "date": "2022-02-04",
    "categories": [
      "ed-tech",
      "stats-ed"
    ],
    "contents": "\nThese slides were presented as part of Computation and Data Science Education Community of Practice (CDS Education CoP) meeting on February 4, 2022.\nSpeakers\nLiza Bolton, Assistant Professor, Teaching Stream, Department of Statistical Sciences\nPaul Gries, Professor, Teaching Stream, Department of Computer Science\nDavid Liu, Associate Professor, Teaching Stream, Department of Computer Science\nKaren Reid, Professor, Teaching Stream, Department of Computer Science\nScott Schwartz, Assistant Professor, Teaching Stream, Department of Statistical Sciences\nNathan Taback, Associate Professor, Teaching Stream, Department of Statistical Sciences\nEvent description\nFor instructors looking to incorporate computation and data science content and skills into their courses, one of the most frequent source of questions and challenges is the technologies they and their students will use. In this session, a team of instructors from the Departments of Computer Science and Statistical Sciences will introduce and demo two web-based platforms used to teach computing, statistics, and data science at the University of Toronto: JupyterHub (currently available to anyone with a UTORid) and MarkUs (available for U of T courses). We will draw on real-life teaching experiences to show the variety of ways these platforms can used, including providing students a cloud-based programming environment and setting up autograding of code-based assessments. Our examples will use the Python and R programming languages, and illustrate some common programming and data science tools like Jupyter notebooks, R Markdown, git, and GitHub.\nThe Computation and Data Science Education Community of Practice (CDS Education CoP) aims to bring together educators to share their experiences designing and implementing educational activities, pedagogical best practices and use of various technologies. to chat with our community and hear about online sessions, including “Technologies for Teaching Computation and Data Science,” on February 4, 12:10-1:30 p.m. on MS Teams. If you have questions, contact nathan.taback@utoronto.ca and david@cs.toronto.edu.\nSlides\nDirect link: https://bolton-cds-w22.netlify.app/#1\n\n\n\nfitvids('.shareagain', {players: 'iframe'});\n\nImage descriptions\nSlide 1\nBackground image is a gif from Dr Strangelove (1964, black and white) of a man waving a cowboy hat and riding a large nuclear bomb that is being dropped out of a plane onto the landscape below.\nSlide 3\nA pixel art based image of a farm surrouned by fences, crops and trees, including two people avatars, one rifing a horse and one carrying corn. This is an image from the Stardew Valley game. Pixel art text made to look like boards of raw wood (with leafy offshoots) are nailed together to form the words “STATDEW VALLEY”. The second ‘t’ in STAT is slightly tilted towards the right while all the others or oriented up and down (to draw attention to it not saying STARDEW).\nSlide 5\nPixelated image of me (Liza) a smiling brunette, with a light skin-tone and feminine presenting. Image was manipulatedfrom an original photo to be pixelated using tools in R.\nSlide 6\nBackground image is a gif from Dr Strangelove (1964, black and white) of a two men grappling (the one in front is in a large black coat and black hat, while the one behind is in a suit). ANother man, bald and in classes approaches from the right of the and addresses them, causing them both to pause. He says “Gentleman. You can’t fight in here. This is the War Room!”\nSlide 12\nA poorly drawn cartoon of a bao with legs and arms, in a pink ballerina outfit, with roses thrown at its feet and the text ‘bao take a bow’ at the top right\nSlide 13\nA process flow diagram with 4 sections.\nPlan: Plan activity based on learning outcomes: commentary, coding tasks, question prompts.\nR:Combine code, commentary, hints, questions, etc., in an RMarkdown document (learnr package).\nGitHub: Push to GitHub (check out GitHub desktop and the website if the terminal isn’t your happy place yet.\nLink: Create a pull link for students with nbgitpuller. Share!\nSlide 14\nGroup of people with dark skin tones dancing outside to the song Watch me (Whip/Nae nae) in front of a abstract mural. The text “WATCH ME DIFF WATCH ME REBASE” has been added above them.\nSlide 15\nScreenshot of nbgitpuller interface filled out for the Statdew Valley activity. Relevant text on slide 16.\n\n\n\n",
    "preview": "posts/2022-02-04-learnr-interactives-or-how-i-learned-to-stop-worrying-and-turn-my-students-into-pixelated-farmers/images/statdewvalley.png",
    "last_modified": "2022-02-04T17:28:07-05:00",
    "input_file": {},
    "preview_width": 1285,
    "preview_height": 737
  },
  {
    "path": "posts/2021-11-22-census-detectives/",
    "title": "Census detectives",
    "description": "Can you correctly order two Canadian censuses, conducted 100 years apart?",
    "author": [
      {
        "name": "Liza Bolton",
        "url": {}
      }
    ],
    "date": "2021-11-22",
    "categories": [
      "stats-ed"
    ],
    "contents": "\n\nContents\nUseful links\nBackground\nA note on langauge\nTask\nWARNING: You’ll see answers if you keep scrolling\nSolutions\n‘Clues’, comments & points of interest\n\nCensus forms\n\nThe following activity is from a sample seminar with my STA497 students on 2021-11-17. It was intended as a model seminar for their own upcoming seminars about topics from Calling Bullshit: The Art of Skepticism in a Data-Driven World, by Carl Bergstrom and Jevin West (see: https://www.callingbullshit.org/) and covered more than just this activity. You can access the slides below\nUseful links\nPDF version of activity\nCheck your ordering with this MS Forms quiz\nSlides (warning, spoilers!)\nBackground1\nThe Constitution Act of 1867 set out the requirement for a census of the population to be taken every 10 years. The first of these decennial censuses took place in 1871 in the four original provinces (Ontario, Quebec, Nova Scotia, New Brunswick). The most recent of these censuses was conducted in 2021.\nA note on langauge\nThere is some language in these censuses that is outdated and can be offensive. These terms are used only in the context of the historical documents from which they have been drawn, and seek to illustrate the development of our social understandings of identity. If you’d like to learn more about the history of these terms, The Canadian Encyclopedia may be a useful place to start.\n‘Eskimo’: https://www.thecanadianencyclopedia.ca/en/article/eskimo\n‘Indian’: https://www.thecanadianencyclopedia.ca/en/article/indian-term\nTask\nComplete each of the following census questionnaires about yourself. (Note, these are not the complete census forms, these are questions about sex/gender, age, and race/ethnicity. These questions have been retyped and somewhat reformatted, but the original text has been preserved. Once you have completed the forms, try to put them in chronological order from oldest to most recent census.\nPDF version of activity\n\n\n\n\n Check your ordering with this MS Forms quiz.\nWARNING: You’ll see answers if you keep scrolling\n\n\n\nfitvids('.shareagain', {players: 'iframe'});\n\nSolutions\n\n\nA = 1996\nB = 1921\nC = 1871\nD = 2021\nE = 1951\n\n\nSomething that I particularly love is that if you ordered these samples from shortest to longest, you have the order from oldest to most recent. I think this is a good indication of how our understanding of identity has become more complex, but also probably that our ability to manage and aggreagate data has improved greatly.\n‘Clues’, comments & points of interest\nUseful source: Guide to the Census of Population, 2016, Chapter 2 – Census history https://www12.statcan.gc.ca/census-recensement/2016/ref/98-304/chap2-eng.cfm\n2021 was the first census to include questions about both gender and sex, specifically defining sex as sex assigned at birth.\nPrior to 2001 data was not collected on couples other than heterosexual couples.\nNotice the change from “live together as husband and wife” in the description of common-law in 1996 to “live together as a couple” in 2021’s description.\nOlder census forms don’t account for common law relationships, and the heads of the house will always be men in a marriage (‘wife’ as a relationship to head option, but not never ‘husband’).\n\nFor the 1951 census a new punch card technology was used make data tabulation faster. That is why the age is set up to record 10s and 1s in the way it is.\nNunavut wasn’t a territory until 1999 and so is not listed in the 1996 census.\nWhat else did you notice? Let me know! @Liza_Bolton\nCensus forms\n1871 census records\n\n1871 questionnaire image the result of searching “Elizabeth Bolton” on https://www.bac-lac.gc.ca/eng/census/1871/Pages/1871.aspx\n1921 census records\n 1921 questionnaire image the result of searching “Elizabeth Bolton” on https://www.bac-lac.gc.ca/eng/census/1921/Pages/search.aspx\n1951 census form\n\n1951 punch card (2 images) from http://www.ccri.uottawa.ca/CCRI/Images/1951%20Schedule.pdf (sourced via https://mdl.library.utoronto.ca/collections/numeric-data/census-canada/1951)\n1996 census form\n[PDF of 1996 census long form questionnaire] (https://www12.statcan.gc.ca/access_acces/archive.action-eng.cfm?/english/census01/info/96-2b-en.pdf)\n2021 census questionnaire\nYou can access the question text here and a sample PDF here.\n\nGuide to the Census of Population, 2016, Chapter 2 – Census history https://www12.statcan.gc.ca/census-recensement/2016/ref/98-304/chap2-eng.cfm↩︎\n",
    "preview": "posts/2021-11-22-census-detectives/images/investigation.jpeg",
    "last_modified": "2021-11-22T13:31:22-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-26_chatfield490/",
    "title": "Expanding on a comment from Chris Chatfield's The Joys of Consulting",
    "description": "A fun little example to deepen your t-test intuitions based on a common student question in STA490.",
    "author": [
      {
        "name": "Liza Bolton",
        "url": {}
      }
    ],
    "date": "2021-09-26",
    "categories": [
      "stats-ed"
    ],
    "contents": "\n\nContents\nSet up the data for experiment A\nStandard paired t-tests\nLet’s Winsorize!\nSimulate changing the extreme value to a range of other values\nIn case you want to play more\n\nOne of the readings for Michael Moon’s and my fourth-year statistics class (STA490: Consultation, Communication, and Collaboration) is the delightful “The joys of consulting” case study from Chris Chatfield in Significance (March, 2007).\nThere is a comment on page 36 that every year students are very interested in…(bolding mine)\n\nFor experiment A, it is noteworthy that, even though all differences have the same sign and the Winsorised sample gives a highly significant result, making the largest observation even more extreme (which might be expected to add to the evidence against the null hypothesis) actually reduces the level of significance. I had not expected this. I knew that significance levels for normal tests were inaccurate when data were skewed, but I did not realise that making an observation more extreme could actually send the significance level in the “wrong” direction.\n\n~ Chris Chatfield, “The joys of consulting” (March, 2007)\nNow this might not make much sense out of context, but I thought I’d write this up as a blog post because it would be easy to share with our students AND, at the same, we could share this fun example that others might like to play around with. Fundamentally, it is just a matter of remembering how the t-test works, but it is really great exercise to check whether your REALLY understand what is going on.\n\n\n\nMy students’ reaction to the above passage every year. Image description: The surprised Pikachu meme, a screen shot from the Pokémon animated series where Pikachu, a yellow electric mouse that fights other pocket monsters, has its mouth wide open in surprise.\nNote: Full credit for choosing this article to Alison Gibbs and Nathalie Moon from whom we happily inherited it from.\nSet up the data for experiment A\n🔥 Hot tip! I just copied the data from the PDF, but saved some time on reformatting thanks to multiple cursors in R Studio. A fun trick for you to check out.\n\n\nexpA <- tibble(\n  sample = c(101, 102, 103, 104, 105, 106, 107, 108, 109),\n  before = c(7.4, 8.9, 11.1, 12.3, 21.8, 39.6, 43, 46.6, 279.6),\n  after = c(6.3, 7.9, 10.3, 11.3, 20.7, 36.8, 38.7, 44.2, 254.8)\n    ) %>% \n  mutate(diff = after-before) %>% \n  arrange(diff)\n\nexpA %>% \n  kbl() %>% \n  kable_styling()\n\n\n\nsample\n\n\nbefore\n\n\nafter\n\n\ndiff\n\n\n109\n\n\n279.6\n\n\n254.8\n\n\n-24.8\n\n\n107\n\n\n43.0\n\n\n38.7\n\n\n-4.3\n\n\n106\n\n\n39.6\n\n\n36.8\n\n\n-2.8\n\n\n108\n\n\n46.6\n\n\n44.2\n\n\n-2.4\n\n\n105\n\n\n21.8\n\n\n20.7\n\n\n-1.1\n\n\n101\n\n\n7.4\n\n\n6.3\n\n\n-1.1\n\n\n102\n\n\n8.9\n\n\n7.9\n\n\n-1.0\n\n\n104\n\n\n12.3\n\n\n11.3\n\n\n-1.0\n\n\n103\n\n\n11.1\n\n\n10.3\n\n\n-0.8\n\n\nStandard paired t-tests\nWhat are our hypotheses for testing experiment A?\n\\(H_0:\\) The average difference in NT-proBNP concentration before and after being refrigerated is 0.\n\\(H_1:\\) The average difference inNT-proBNP concentration before and after being refrigerated is NOT 0.\nIf you run ?t.test you’ll get a refresher on how this function works. We input the differences column (not the before and after columns) because this is a paired t-test. The default value of \\(\\mu\\) is 0 which is the correct null value for our investigation.\n\n\nt.test(expA$diff)\n\n\n\n    One Sample t-test\n\ndata:  expA$diff\nt = -1.6902, df = 8, p-value = 0.1295\nalternative hypothesis: true mean is not equal to 0\n95 percent confidence interval:\n -10.324340   1.591007\nsample estimates:\nmean of x \n-4.366667 \n\nWe see that we have a large p-value (larger than 0.05) and so have no evidence against the claim that the the NT-proBNP concentration before and after being refrigerated is 0.\nLet’s Winsorize!\nRead the article to understand why I’m about to do this as well as the final analyses Chatfield recommended.\nAs I already arranged this dataset when I made it above, I know that my most extreme difference is in the first row. I’ll replace it with the next most extreme value, in the second row, and then re-run the t-test.\n\n\n# create base for Winsorizing\nexpA_wins <- expA \n\n# Winsorize (note this code isn't necessarily generalizable!)\nexpA_wins$diff[1] <- expA_wins$diff[2] \n\n\n\n\n\nhist(expA_wins$diff)\n\n\n\n\nHmmm, looks pretty ugly still when it comes to our normality assumption!\n\n\nshapiro.test(expA_wins$diff)\n\n\n\n    Shapiro-Wilk normality test\n\ndata:  expA_wins$diff\nW = 0.7965, p-value = 0.01863\n\nAnd not normal enough for Shapiro-Wilk’s test, and that often gives a pass to small samples sizes, even when it shouldn’t.\n\n\n# t-test\nt.test(expA_wins$diff)\n\n\n\n    One Sample t-test\n\ndata:  expA_wins$diff\nt = -4.381, df = 8, p-value = 0.002346\nalternative hypothesis: true mean is not equal to 0\n95 percent confidence interval:\n -3.1884096 -0.9893681\nsample estimates:\nmean of x \n-2.088889 \n\nSo, as described, when we Winsorize, we get a significant result from the paired t-test. Why do we get this significant result when we DECREASE the average difference?\n\n\nVersion\n\n\nMean difference\n\n\nStandard deviation\n\n\nRaw\n\n\n-4.37\n\n\n7.75\n\n\nWinsorized\n\n\n-2.09\n\n\n1.43\n\n\nRecall how a t-test statistic is calculated (D is for difference, because our values were paired):\n\\[t = \\frac{\\bar{X}_D - \\mu_0}{s_D/\\sqrt n}\\]\nThe critical value we’re comparing \\(t\\) it to will stay the same, as we’re not changing sample size, so we need to just think about the relationships in this formula.\n\\(\\mu_0\\) is the hypothesized value of 0 and that will stay the same, and\n\\(n\\) will also stay the same as we’re not removing or adding data, just dragging a point around.\nTherefore, all we’re thinking about is the following relationship:\n\\[t \\propto \\frac{\\bar{X}_D}{s_D} \\]\nRecall that \\(\\propto\\) indicates ‘proportional to’.\nSimulate changing the extreme value to a range of other values\nYou may already be able to see where this is going, but let’s make some pictures!\n\n\nsimulation <- tibble(\n  group = rep(1:100, each = 9),\n  diff = rep(expA$diff, 100),\n  obs = rep(1:9, 100)\n) %>% \n  arrange(obs) %>% \n  mutate(extreme_val = rep(round(seq(-50, 0, length.out = 100), 2), 9))\n\n# replace the most extreme value with a series of other values\nsimulation$diff[1:100] = round(seq(-50, 0, length.out = 100), 2)\n\nsimulation_grouped <- simulation %>% \n  group_by(group, extreme_val) %>% \n  select(-obs) %>% \n  nest() %>% \n  mutate(t_test = map(data, ~{t.test(.) %>% tidy()})) %>% \n  unnest(cols = c(data, t_test)) %>% \n  select(-parameter, -method, -alternative) %>% \n  mutate(sd = sd(diff))\n\n\n\n\n\n\nBy the way, this kind of chart is exactly what you shouldn’t do in an acutal analysis. We can’t just pick a value that gives us a significant test result!\nSo what is going on? Just some math! As the value the extreme value takes decreases, the estimated average difference gets closer to 0, sure, BUT the standard deviation, which is the denominator in the relationship above, decreases, and decreases more quickly than the estimate is decreasing! (Think about the calculation of the standard deviation to see why.). Reducing the extreme value reduces the variability in our sample and so we can actually get a bigger test statistic from a smaller observed average difference!\n\n\n\nPractice question: Can you calculate the value for the minimum standard deviation?\nAnother way to look at this is through the other side of the p-value coin, the good ol’ confidence interval.\n\n\n\nIn case you want to play more\n\n\nexpB <- tibble(\n  sample = 1:19,\n  before = c(7.19, 60.64, 20.56, 4076, 14.69, 23.65, 15.37, 11.71, 36.48, 211.1, \n             413.7, 24.5, 18.4, 96.23, 15.61, 6.78, 141.7, 187.7, 29.57),\n  after = c(6.55, 60.85, 19.92, 3954, 13.74, 23.65, 15.2, 11.88, 36.7, 211.1, \n            422.1, 23.53, 18, 93.01, 15.3, 6.47, 140.6, 185.3, 29.17)) %>% \n  mutate(diff = after-before) %>% \n  arrange(diff)\n\nexpB\n\n\n# A tibble: 19 × 4\n   sample  before   after     diff\n    <int>   <dbl>   <dbl>    <dbl>\n 1      4 4076    3954    -122    \n 2     14   96.2    93.0    -3.22 \n 3     18  188.    185.     -2.40 \n 4     17  142.    141.     -1.10 \n 5     12   24.5    23.5    -0.970\n 6      5   14.7    13.7    -0.950\n 7      1    7.19    6.55   -0.640\n 8      3   20.6    19.9    -0.640\n 9     13   18.4    18      -0.400\n10     19   29.6    29.2    -0.400\n11     16    6.78    6.47   -0.310\n12     15   15.6    15.3    -0.310\n13      7   15.4    15.2    -0.17 \n14      6   23.6    23.6     0    \n15     10  211.    211.      0    \n16      8   11.7    11.9     0.17 \n17      2   60.6    60.8     0.210\n18      9   36.5    36.7     0.220\n19     11  414.    422.      8.40 \n\nt.test(expB$diff)\n\n\n\n    One Sample t-test\n\ndata:  expB$diff\nt = -1.0185, df = 18, p-value = 0.322\nalternative hypothesis: true mean is not equal to 0\n95 percent confidence interval:\n -20.071319   6.965003\nsample estimates:\nmean of x \n-6.553158 \n\nOne thing I wasn’t sure about was whether Chatfield took the next most extreme by moving to next value in order (i.e., for experiment B, from -122.00 to -3.22) or to truly the next biggest (i.e., -122.00 to 8.40). This doesn’t matter for A, but does for B.\nI couldn’t replicate the significant result Chatfield mentioned for Experiment B, but I also didn’t spend too much time trying. Let me know if you figure it out.\n\n\nexpB_wins <- expB\n\n# replace with next on number line\nexpB_wins$diff[1] <- expB_wins$diff[2] \nt.test(expB_wins$diff)\n\n\n\n    One Sample t-test\n\ndata:  expB_wins$diff\nt = -0.5581, df = 18, p-value = 0.5837\nalternative hypothesis: true mean is not equal to 0\n95 percent confidence interval:\n -1.436854  0.833696\nsample estimates:\n mean of x \n-0.3015789 \n\n# replace with next biggest overall\nexpB_wins$diff[1] <- expB_wins$diff[19] \nt.test(expB_wins$diff)\n\n\n\n    One Sample t-test\n\ndata:  expB_wins$diff\nt = 0.45329, df = 18, p-value = 0.6558\nalternative hypothesis: true mean is not equal to 0\n95 percent confidence interval:\n -1.12681  1.74681\nsample estimates:\nmean of x \n     0.31 \n\n# replace with next biggest overall, but match sign\nexpB_wins$diff[1] <- -expB_wins$diff[19] \nt.test(expB_wins$diff)\n\n\n\n    One Sample t-test\n\ndata:  expB_wins$diff\nt = -0.85152, df = 18, p-value = 0.4057\nalternative hypothesis: true mean is not equal to 0\n95 percent confidence interval:\n -1.9909449  0.8425238\nsample estimates:\n mean of x \n-0.5742105 \n\n\nCover image by Mohamed Nohassi on Unsplash\n\n\n\n",
    "preview": "posts/2021-09-26_chatfield490/images/mohamed-nohassi-odxB5oIG_iA-unsplash.jpg",
    "last_modified": "2021-09-25T23:38:49-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-07_automate/",
    "title": "Automagical email and admin for large courses",
    "description": "Getting started with Power Automate.",
    "author": [
      {
        "name": "Liza Bolton",
        "url": {}
      }
    ],
    "date": "2021-09-08",
    "categories": [
      "ed-tech"
    ],
    "contents": "\n\nContents\nThe big picture experience\nStudent experience\nTeaching team experience\nWhen is this useful?\n\nExamples and resources\nWaitlist info sign up\nRegrade request\nDeclaration of illness or emergency\nRecording due dates for grad school references\n\n\nI want to share something that has been a bit of lifesaver for me when teaching large classes. Here at the University of Toronto we use the Microsoft Office suite of tools, and this provides access to Outlook, Forms, OneDrive and something called Power Automate. I use these in combination to help me with administering a range of areas in my courses.\nHere is the video I threw together to demo this. I know it’s not super tight in places, but I this is me practising saying to myself on being to ‘extra’. Kind of. I did still make the video…\n\n\nThe big picture experience\nStudent experience\nStudent fills out a form, gets an email response immediately and from there can access resources/take action/get information they need.\n\nTeaching team experience\nCreate an MS Form and set up an associated Power Automate flow.\nProvide a link to the From to your students, e.g., in your email autoresponder, linked in announcements, on a ‘Forms’ page on your course website.\nReceive preformatted emails to respond to and/or track requests in a spreadsheet automatically for later checking, and/or collect documents in organized folders on OneDrive.\n\nWhen is this useful?\nHere are some broad categories:\nA student has to write you a pretty formulaic email to trigger some administrative thing (regrade request, accommodation for being sick) but\nstudents frequently forget important information (which assessment this applies to, what their ID is, etc.), and/or\nstudents spend a lot of time stressing about writing the email—I’m sure I’m not the only one who has been told about explosive diarrhea in much more detail than I needed.\n\nYou want to keep track of some data that students are providing, and their provision of this data triggers a next milestone/piece of information. For example, students on the waitlist wanting to receive information about your course, but you want some sense of the volume of demand or just not to put it all on a public site. This could also work well for only giving access to data/instructions for a task once a team had registered their members, or perhaps for a digital scavenger hunt where one step had to be completed successfully before the next was unlocked.\nI’m sure there are many more use cases and I’d love to hear what you come up with, if you do use this! I’m on Twitter, @Liza_Bolton.\nExamples and resources\nWaitlist info sign up\nBoth of the large courses I teach on a regular basis usually have waitlists at the beginning of semester. The other instructors and I receive tens of emails asking about accessing resources as they wait to hopefully join the course, and of course about whether we can move students off the waitlist, which we cannot.\nAs we co-teach this course and have a very involved head TA, we also use a course email, instead of our personal U of T emails for all course matters. I set it up so that the email with information is sent from our course email so that student respond there if they have any further questions.\nSTA130 waitlist resource sign up (Fall 2021) form template\nMy Power Automate waitlist flowRegrade request\nSTA130 Fall 2021 template for regrade request form (the one in the video)\nGet the Power Automate flow (PDF) that goes with the above form\nSTA303/1002 Winter 2021 template\nDeclaration of illness or emergency\nSTA130 Fall 2021 template for illness/emergency declaration (the one in the video)\nGet the Power Automate flow (PDF) that goes with the above form\nSTA303/1002 Winter 2021 template\nRecording due dates for grad school references\nThis one is a more complicated flow to set up, but if you write a lot of references and would like to capture the information for the students you’re writing for and have the due dates automatically added to your calendar, and the student invited to the calendar event to, this is definitely possible!\nHere is the template for my old form for this…but! One of our staff team is actually working on a more generalizable system that multiple profs could use that would also include an approval step, so students would request the reference, we’ll make a judgment on whether we could write them a letter that would strengthen their application, and then if we accept, the dates get added to our calendar.\n\nI’ve also just posted a more general blog with resources/ideas/examples of some other things I am doing for Fall semester. Is your autoresponder playing defense for you? Have you pimped your email signature lately? Did you know Canvas/Quercus supports bootstrap for layouts?\n\nCover photo by Karly Santiago on Unsplash\n\n\n\n",
    "preview": "posts/2021-09-07_automate/images/magic.png",
    "last_modified": "2021-09-07T22:42:23-04:00",
    "input_file": {},
    "preview_width": 1760,
    "preview_height": 778
  },
  {
    "path": "posts/2021-09-07_fall-thoughts/",
    "title": "🍂 Fall thoughts 🎃",
    "description": "A collection of resources and things I'm working on that may or may not be useful to you too.",
    "author": [
      {
        "name": "Liza Bolton",
        "url": {}
      }
    ],
    "date": "2021-09-08",
    "categories": [
      "ed-tech",
      "admin"
    ],
    "contents": "\n\nContents\nWhat’s in your email signature?\nIs your autoresponder playing defense for you?\nAutomagical email and admin for large courses\nMaking your Quercus/Canvas pretty\nJupyterHub and RStudio\nMusic and notices before class/during breaks\nPiazza thank you cards\nStudent voice\n\nThis isn’t particularly well organized but it was nice to get a few things out of my head.\nWhat’s in your email signature?\nYou can include links to mental health and other student services so that they are always at people’s fingertips. I also include:\ninformation about my pronouns and how to use them. But Liza, you say, everyone knows how to use “she” and “her” in a sentence, right? Well, yeah, probably. But this creates room for folks with neopronouns and still might be of use to English language learners who might not have any idea what gender my name suggests.\nAn explicit note about how and when I use emails to try to set expectations and maintain my own boundaries while also showing respect for other people’s.\n\n\nProf. Liza Bolton / Assistant Professor, Teaching Stream\nPronouns: she/her/hers\nDepartment of Statistical Sciences, / University of Toronto\nwww.statistics.utoronto.ca | www.lizabolton.com \n🕘 Whatever time at which I’m sending this email works for me. I do not expect that you will read, respond to, or action this email outside of the hours that work for you. I am most likely to check emails 10–6 ET, Monday through Friday.\nCOVID-19 Student FAQs | Faculty of Arts & Science\nDoing okay? It is always okay to reach out for support!\n• My Student Support Program – My SSP – mental health support for all U of T students. Free, confidential, immediate support. Available 24/7 in multiple languages. Download the My SSP App or call 1-844-451-9700. uoft.me/myssp\n• Call Good2Talk, a free, confidential helpline for people in Ontario. Professional counselling, information and referrals for mental health, addictions and well-being, 24/7/365 1-866-925-5454\n\n\nIs your autoresponder playing defense for you?\nI keep my autoresponder on all year round. It is maybe a bit of pain for my colleagues (sorry folks!), but it saves me so much email angst that I am never going back to the old ways. If you want, you can read my lastest verion, without sending me an email right here.\nOur department meditation facilitor said she was proud of me for this, setting boundaries and all that, so if you too want to make your department’s meditation facilitor1 proud, go for it!\nAutomagical email and admin for large courses\nSee my post, Automagical email and admin for large courses: Getting started with Power Automate for a run down of a workflow that helps me manage large classes and make my and my students’ lives easier.\nMaking your Quercus/Canvas pretty\nThis is especially great for when there is other work you should be doing, but you want to do some “productive” procrastination instead.\nCallout boxes\nSome great grab and go code here: https://docs.google.com/document/d/1_pAW74yURHuWRD52Rp8DkAfXltJDPc1f44_YGcPW1t0/edit#\nMy current favourite thing is using the bootstrap responsive boxes in one of these callouts with a little picture to signal if something is note or a tip or a ‘to do’.\n<div style=\"width: 50%; margin: 10px 25% 10px 25%; background-color: #3c133f;\">\n    <div style=\"position: relative; top: -10px; left: -10px; padding: 15px; \n    background: #ffffff; border: 2px solid #3C133F;\">\n        <div class=\"content-box\">\n            <div class=\"grid-row\">\n                <div class=\"col col-lg-2 col-sm-12\">\n                    <p><span><img style=\"display: block; margin-left: auto; \n                    margin-right: auto;\" src=\"/courses/235890/files/15714819/preview\" \n                    alt=\"Line art of a lightbulb\" width=\"64\" height=\"64\"\n                    data-api-endpoint=\"https://q.utoronto.ca/api/v1/courses/235890/files/15714819\" \n                    data-api-returntype=\"File\" /> <\/span><\/p>\n                <\/div>\n                <div class=\"col col-lg-10 col-sm-12\">Save a copy of the \n                syllabus for your records. <br> It can come in handy long after \n                the course ends!<\/div>\n            <\/div>\n        <\/div>\n    <\/div>\n<\/div>\nYou’ll need to change the image path for this to work for your own courses, but it will look something like this:\n\nQuercus (Canvas) let’s you use bootstrap to make responsive pages!\nThis is a slightly older version of our current STA130 home page, but it gives you a general sense of the look. The great thing about this page is that it adjust how it presents all the boxes/buttons when you are on a smaller screen.\nI have shared some example html code in a GitHub repo and there is lots of advice from more skilled folks below.\nA useful video\nWebsite companion\n\nYou can see what Bill Ju @NeuroscienceUT has been up to with this on his course page, too!\n\n\nSo my colleagues have been sharing code and glowing up their Quercus pages - thank you for the code and inspiration and help! Acknowledging all those involved - @Liza_Bolton @karenreid @JenniferAHarri2 and Max!! pic.twitter.com/aRWCnKT7tw\n\n— Bill J (@NeuroscienceUT) August 24, 2021\n\nJupyterHub and RStudio\nThis one is really just for other folks at U of T using the JupyterHub and RStudio, but that could still potentially be one of you reading this.\n\n\nI embed this on Quercus on a ‘Course tools’ page for easy students access. The embed code is:\n<iframe src=\"https://rstudio-with-jupyerhub-uoft.netlify.app\" width=\"100%\"\nheight=\"500\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"><\/iframe>\n\nMusic and notices before class/during breaks\nIn both in-person and online teaching I love playing music over scrolling notice slides as I finish getting set up. You can ask the students for recommendations (I often do this in weekly check-in surveys or just ask them to email me) and/or spend way to much time finding fun songs that are somehow on theme (Jump In the Line by Harry Belafonte for linear regression, anyone?). I sent my third-years a farewell email with our co-created playlists and the response was lovely.\nIf you’re at U of T, Student Life posts weekly slide decks that I just download, remove anything irrelevant to my students and add in reminders/Department events, etc. I made this below video this time last year (sorry it is only on U of T’s internal MS Stream!).\n\n\n\n\n\n\nPiazza thank you cards\nPiazza (and probably Ed?) lets you easily access data on how many posts each student makes and how many they have read. We often send thank you cards to our top lurkers (them being across all the makes my life easier!) adn top posters. At some point I plan to do a tutorial on this, so let me know if you’re interested. Great mail merge opportunity in large classes.\nStudent voice\nA few of us in the Department of Statistical Sciences are continueing a small pilot of a student representation initiative called the Undergraduate Consultative Committee. One of our students comms team members wrote this article about last semester’s phase 1 of the pilot.\nIf youre interested in creating a culture of feedback but something like that above isn’t the right fit for your course or the present moment, some of my other favourite tools are clearest point/muddiest point style weekly check-ins, and/or adding a mid-semester survey with your students. These are a fabulous way to tweak and improve your course as you go, instead of having “oh, dang, I wish someone had told me that earlier” moments when you read your course evaluations. I also think it is really important to spend some of your time responding to what your hear from students, I often do this at the start of the next class. There is a nice article from our Centre for Teaching Support & Innovation (CTSI): The Many Benefits of Cultures of Feedback within the Classroom\n\nCover image from Bo Burnham’s ‘White Woman’s Instagram’\n\nYour department doesn’t have a meditation group? That’s no good. Contact Cecilia, she is awesome. Clutter Coaching is her main thing, but she’s excellent as a meditation facilitator too. https://www.spaceforlife.ca/contact-1↩︎\n",
    "preview": "posts/2021-09-07_fall-thoughts/images/bo-pumpkin.jpeg",
    "last_modified": "2021-09-09T19:59:52-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-07-13_autoresponder/",
    "title": "My email autoresponder as of July 13, 2021",
    "description": "Potentially easier format in which to read my message.",
    "author": [
      {
        "name": "Liza Bolton",
        "url": {}
      }
    ],
    "date": "2021-07-14",
    "categories": [
      "admin"
    ],
    "contents": "\n\nContents\nReferences\nCourse enrolment\nWill [STA130/STA490/STA303] be able to be completed online-only?\nSTA490 FAQs\nSyllabi\nReading courses\nResearch opportunities/Masters/PhDs\nTeaching assistant opportunities\n\nI get a lot of emails. A lot of similar emails. So, I have an email auto-response on all-year round.\nBelow is a lightly reformatted version of my current message, just in case you find it easier to access here. Note: This is the version that is internal to U of T, slightly different version for external emails.\nAm I worried that this is less friendly and personable than I’d want to be be? Yes. But when was the last time you received and amazing admin email anyways? I highly recommend considering this for anyone working with a large number of people with similar questions! It means (I hope) fewer people are waiting on you for simple answers and you have more time to address complicated or unique questions.\nHi there,\nThanks for reaching out! I get a lot of the same questions from students, so to hopefully save you and me time, I have set up this automatic reply to address several frequently asked questions. Last updated July 13.\nIf your question isn’t related to the below, I will respond when I can.\nNote: I will be unavailable August 12–22, inclusive.\nIf your email is related to one of the topics covered below, please consider this automatic reply my response. Please note that this is especially the case for references.\nReferences\nI won’t currently be saying yes to any grad school references for right now or for the next academic year, but am planning to develop more advice for students about the who/how/what of approaching me for reference letters and my policies. This won’t be till August/September, but below is some guidance on what to expect.\nTo be able to write a reference that would actually strengthen your application, AND to have fair criteria considering that I get easily 100–150 requests per year and can usually only write for about 20–25 students (I know that sounds small…but it still takes roughly a whole work week of time), my usual minimum criteria is at least TWO out of the following activities with me:\nactive on Piazza/office hours + good mark in a large standard class-based course (like STA303),\nstudent representative role,\nRA work, TA work, or\na reading course.\nSome examples from 2020/21 of students I said yes to:\nseveral students who had high marks in STA303 and were active and doing well in STA490 with me,\nstudents who had done STA303 and gone on to do great work as TAs or peer mentors for STA130 when I was teaching, and\na student who had done STA303 and was working on a reading course with me.\nCourse enrolment\nI cannot add students to a course, waive prerequisites or move you off a waitlist. Please reach out to the UG stats team (ug.statistics@utoronto.ca) about questions of this nature.\nBook an appointment during their office hours.\nThere will also be an enrolment hotline that you can access via this link on July 12th, 15th, 19th, and 30th from 9am-noon EST to speak with someone.\nFor grad courses, please email grad.statistics@utoronto.ca.\nWill [STA130/STA490/STA303] be able to be completed online-only?\nYes. More information below.\nSTA130 is a completely online course (look for the ‘99’ code in the section number. More information in the Arts & Science FAQ.) All content and assessment will be accessed/completed online.\nSTA490 lectures will be online, and you will have a choice (subject to health advice) about whether you sign up for in-person or online project meeting sections. All assessments will be completed and submitted online.\nSTA303 will be a flipped course, with content delivered online and opportunities for activities both in-person (subject to health advice) and online. All assessments will be completed and submitted online.\nSee also https://www.lizabolton.com/teaching.html. (Mostly just the same info as above).\nSTA490 FAQs\nWho can apply to take this course?\nYou will be prioritized for a spot in STA490Y1 in 2021–22 if you are on track to complete the Applied Statistics Specialist or a Specialist in Statistical Science: Methods and Practice program (including a Focus) in 2021–22, and you have successfully completed STA303H1, STA304H1/STA305H1, and STA355H1. Should space in the course permit, students pursuing a Statistics Major, or another Statistics specialist program offered in the UTSG Department of Statistical Sciences (i.e., the Statistics Specialist, the Specialist in Statistical Science: Theory and Methods, or the Data Science Specialist) will be considered for enrolment in STA490Y1. Decisions for students in these other Statistics programs of study will be made based on when the application for enrolment in STA490Y1 was received, the number of 300- and 400- level STA courses taken, and marks in these courses.\nHow do you apply?\nFill out this form https://forms.office.com/r/LP1XuBJzzk by July 29, 2021.\nWill you be able to select which section you will be enrolled in?\nThis will most likely be assigned based on the the range of experience and focus subjects among the selected students, as well as preferences for online or in-person meetings (selected students will be asked about this in a further survey).\nSyllabi\nMy 2021–22 syllabi are not yet available to students. Previous syllabi are available on the Department website (but will change year to year).\nReading courses\nI will not be taking on any students for Spring/Summer 2021. That said, reading courses are a great opportunity and I hope you will approach other Profs in the department! I will be considering taking on a small number of STA496 students for a half-credit, year long version in 2021-22. I’ll make more information available on this in August. See also: https://www.lizabolton.com/reading_courses.html.\nResearch opportunities/Masters/PhDs\nI do not have any research opportunities currently available. Please see the graduate section of our Department website for more information: https://www.statistics.utoronto.ca/graduate.\nTeaching assistant opportunities\nSee the Department website. The main round of TA recruitment is ongoing at the time of writing, applications close July 21.\nDisplay photo by Onlineprinters on Unsplash.\n\n\n\n",
    "preview": "posts/2021-07-13_autoresponder/images/at.jpg",
    "last_modified": "2021-09-04T14:39:26-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-07-12_two-cultures/",
    "title": "Learning from Data: The Two Cultures (journal club)",
    "description": "Some notes and questions based on Breiman's article before",
    "author": [
      {
        "name": "Liza Bolton",
        "url": {}
      }
    ],
    "date": "2021-07-13",
    "categories": [
      "stats-ed"
    ],
    "contents": "\n\nContents\nCheck list before we get started\nBackground on this talk\nWhy two cultures?\nDiscussion questions\nQuotes I liked\n\nThese are some notes for a fairly impromptu journal club for the Independent Summer Statistics Community in the Department of Statistical Sciences at the University of Toronto. The idea is to chat about the original article before going to a talk called ‘Learning from Data: The Two Cultures’. (Info/registration). The speaker is Adji Bousso Dieng (Founder, The Africa I Know; Google AI; Princeton University (Incoming)) and moderator is David Blei (Columbia University; ACM Prize in Computing Recipient).\nBreiman’s article, free and in full: http://www2.math.uu.se/~thulin/mm/breiman.pdf.\nCheck list before we get started\nRegistered for the talk\nHave the paper open (even if you haven’t had a chance to read it all)  Introduce yourself: Name, year & program of study, why you were interested in this talk.\nBackground on this talk\nThis talk is part of a series of ‘TechTalks’ from the Association for Computing Machinery (ACM). You can view past ACM TechTalks on their learning portal. They also have a podcast series, ByteCast.\nWhy two cultures?\nYou’ll see the idea of ‘Two Cultures’ in STEM related topics pop up now and then and (I think) they call back to a lecture given by C. P. Snow in 1959 (Wikipedia). His talk (and later book) was about how the sciences and the humanities has become two separate ‘cultures’ and that this split was a problem when it comes to trying to solve our big problems.\nDiscussion questions\nRight at the start of the introduction, Breiman says there are two goals for traditional statistical analyses: prediction and information. In your studies so far, have you done both, one more than the other, only one?\nAre you more naturally a data modelling culture member or an algorithmic modelling culture member?\nDoes Breiman’s estimate of what percentage of statisticians are in each culture seem right 20 years later? Does it surprise you?\n\nWriting: Did you find this article easy or hard to read? What did you like/helped? What was difficult?\nIn the description of the Ozone project (Section 3.1), how did the way the training and test sets were set up differ to what you might have seen usually done? Why do you think this was? Could the normal way also have worked? (Note: if you’ve never encountered training/test sets, let’s talk about that!)\nIn section 3.3, Breiman discusses his perceptions about statistical analysis after year of consulting, upon going back into academia. Did any of these surprise you? Do you disagree with any? Which of these perceptions do you already hold?\nIn section 5.2, when residual analysis is helpful/not for understanding model fit. Was there anything new you learned from this section?\nSection 5.3, discusses ‘the multiplicity of data models’. What does this mean to you? Can you connect it to the idea ‘all models are wrong, but some are useful’?\nBreiman set up the below as his goals for the paper. Do you think they were achieved?\nFocusing just on the data modelling culture has:\nLed to irrelevant theory and questionable scientific conclusions;\nKept statisticians from using more suitable algorithmic models;\nPrevented statisticians from working on exciting new problems;\n\n\nWhat is one thing in the article you’d like to learn more about and how? (Self-learning, in your courses, at future optional events?)\nIn the summary for the upcoming talk, it is stated that “there is a growing community of researchers working on methodologies embracing both cultures”, but goes on to identify two NEW cultures and how they need to work together. Any predictions about this topic? Examples from your own experience?\nQuotes I liked\n“If our goal as a field is to use data to solve problems, then we need to move away from exclusive dependence on data models and adopt a more diverse set of tools”\n“One is left with an unsettled sense about the arbitrariness of residual analysis”\n“Occam’s Razor, long admired, is usually interpreted to mean that simpler is better. Unfortunately, in prediction, accuracy and simplicity (interpretability) are in conflict”\n“the emphasis needs to be on the problem and on the data.”\nDisplay photo by freestocks on Unsplash\n\n\n\n",
    "preview": "posts/2021-07-12_two-cultures/images/tea.jpg",
    "last_modified": "2021-09-04T14:39:26-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-25_uscots2021/",
    "title": "USCOTS 2021",
    "description": "Notes and links from USCOTS 2021. I often find I get the most from conferences if I take notes with the vague notion of sharing them. So this is mostly for me, but I hope it might be of interest to others, too. Note: This post will be updated sporadically.",
    "author": [
      {
        "name": "Liza Bolton",
        "url": {}
      }
    ],
    "date": "2021-06-28",
    "categories": [
      "conferences",
      "stats-ed"
    ],
    "contents": "\n\nContents\nGoing Live: Live Coding as an (Incredibly) Effective Tool for Teaching Programming\nPanel Discussion on “Expanding Horizons and Fostering Diversity”\nReading list\nBooks\nArticles\n\n\nUnited States Conference on Teaching Statistics https://www.causeweb.org/cause/uscots/uscots21\nProgram: https://www.causeweb.org/cause/uscots/uscots21/program\nThis conference did something very cool in creating a Google Doc for shared conference notes! I won’t share that link here as I believe it is intended to be private to the conference attendees, but\nGoing Live: Live Coding as an (Incredibly) Effective Tool for Teaching Programming\n Mine Cetinkya-Rundel, Duke, University of Edinburgh, RStudio,  @minebocek\n Resources from Mine: https://mine-cetinkaya-rundel.github.io/golive-uscots/ (slides have all the links and are a great example of nice Xaringan slides…or at least I assume that’s what she’s used. They look great.)\nBenefits of live coding\nIt slows you down!\nYou actually say the name of the functions, modelling pronunciation and making it easier for students to ask questions about it!\nyou are showing process thinking as well. How do you set up your workflow?\n“Unintended knowledge transfer” how do you learn more, watching a YouTube cook-through or reading a recipe.\nTURN 👏 YOUR 👏 ERRORS 👏 INTO 👏 TEACHABLE 👏 MOMENTS\nshows you don’t have to be perfect to be able to code!\nbut this can be embarrassing or stressful…have the “something I prepared earlier” cooking show approach.\npromise the follow-up if you can’t resolve the error on the fly, have a plan B so you can be more comfortable.\nCan model things like standard practice of putting loaded packages at the beginning but SHOW that you don’t always know all the ones you want to use and so you’ll add back at the top as you go (demonstrates order)\n\nRUN RUN RUN! You’re not being charged for each run, be as lavish as you like.\nEmphasizes importance (without you having to learn to fight Xaringan…)\nThere is empirical evidence (largely from the CS literature) about this being useful for students.\nBUT! Don’t just live code\nMore formats to engage > just one\nEasy to lose/demotivate people\nCan be hard to capture (better with recording)\nSwitching between contexts (slides, live code) is a useful signal and moment to re-engage\nHow do we decide?\nLive code first if it’s how you use tools, like reprexes or using GitHub\nStatic first: new syntax and interpreting results\nLive coding considerations\nTEST, TEST, TEST, does this work on small screens? (Online)\nWhat’s the experience of the person at the back (In-person)\nMine’s students requested that she code with a dark background, because they were watching videos at night.\nYou can show how to set up the theming, too!\n\nWhen live coding in Zoom, Mine has moved the console up to the top right (on Zoom) to help it be less occluded by the Zoom bar. (Show them how to do it!)\nFor webinars and webcasts, Mine does short videos that she can narrate.\nHave a way to show the student experience of a tool (like a student account)\nChanged camera location of speaker to show different interaction styles. For the application exercises, where students are likely to code-along, the location is better for typing, vs something that is more focused on just watching the screen.\nCan use learnR modules for more ‘on rails’ live coding.\nGeneral list of things I like when Mine teaches and that I should copy:\nShares and reshares links in chat\nHas shortlink in footer of every slide\nModel running code that doesn’t run because you didn’t load the package\nDown arrow runs all code chunks above\nBrowser pop-up “You have not done anything wrong”\n“Show restraint from your usual workflow” try not to just auto-close a pop-up you know well but they’ve never seen\nGear icon (next to Knit) to stop treating like an notebook and just output to console.\n\nStart with factory settings and teach customization\nLinks\nSpeaking R from Amelia McNamara\nVideo: https://www.youtube.com/watch?v=ckW9sSdIVAc (thanks Nick Seewald)\nSlides: https://www.amelia.mn/SpeakingR/#1 (thanks Allison Theobold)\n\n📦 livecode from Mine https://github.com/rundel/livecode\nCaveat: work being done!\n\n📦 asciicast https://github.com/r-lib/asciicast\nMouseposé for showing what you’re typing! I’m in love!\nOperating in an error prone world module from the DoSS toolkit https://dosstoolkit.com/#operating-in-an-error-prone-world\nPanel Discussion on “Expanding Horizons and Fostering Diversity”\nCheck out Amy Hogan’s awesome live tweets!  @alittlestats\n\n\nGood afternoon. Today's #USCOTS21 keynote is a panel discussion featuring Felicia Simpson, Jacqueline Hughes-Oliver, Jamylle Carter, Prince Afriyie, Samuel Echevarria-Cruz: “Expanding Horizons and Fostering Diversity”\n\n— Amy Hogan (@alittlestats) June 29, 2021\n\nDiversity statement’s for syllabi/teaching statements - https://statistics.sciences.ncsu.edu/resources/faculty/sample-diversity-statement/ - https://www.brown.edu/sheridan/teaching-learning-resources/inclusive-teaching/statements\nSetting the stage activity: https://danaernst.com/setting-the-stage/\n\n\nWe have to convince students they have been lied to - that math literacy is innate and reading literacy is something you work for ~ Samuel Echevarria-Cruz #USCOTS21\n\n— Judith Canner (@DrCanner) June 29, 2021\n\nReading list\nBooks\n Goodreads bookshelf.\nWilson, G. (2019). Teaching Tech Together How to create and deliver lessons that work and build a teaching community around them. https://teachtogether.tech/en/index.html\nEbony Omotola McGee. (2020). Black, Brown, Bruised: How Racialized STEM Education Stifles Innovation.\nArticles\nRubin, Marc J., (2013). The effectiveness of live-coding to teach introductory programming. https://dl.acm.org/doi/10.1145/2445196.2445388\nRaj, Patel, Halverson, Halverson. (2018). Role of Live-coding in Learning Introductory Programming. https://dl.acm.org/doi/10.1145/3279720.3279725\n\n\n\n",
    "preview": "posts/2021-06-25_uscots2021/images/uscots.png",
    "last_modified": "2021-09-04T14:39:26-04:00",
    "input_file": {},
    "preview_width": 1703,
    "preview_height": 1702
  },
  {
    "path": "posts/2021-06-16-braiding-sweetgrass/",
    "title": "Braiding Sweetgrass by Robin Wall Kimmerer",
    "description": "Links for Rohan Alexander's reading group.",
    "author": [
      {
        "name": "Liza Bolton",
        "url": {}
      }
    ],
    "date": "2021-06-25",
    "categories": [
      "books"
    ],
    "contents": "\n\nContents\nResources\nU of T\nIndigenous Data Sovreignty\nDish With One Spoon\nMore books\nTwitter\nOther\nThanks\n\n\nHi, I’m Liza. I’m a Settler Canadian, born here, but lived half my life in Aotearoa New Zealand on Tainui and then Ngāti Whatua lands and now back on ‘Dish With One Spoon’ treaty lands.\nI’m really delighted that your group has been reading Braiding Sweetgrass, especially as June is National Indigenous History Month in Canada, so nicely done. But more importantly, you’ve been reading this as we learn more and more about the unmarked graves of Indigenous children at residential schools and perhaps grappling with what the upcoming Canada Day can or should mean to you.\nRohan invited me along to say hi because he knows I read this book because, a while back, I was up tweeting at 3:00 a.m. about how I couldn’t stop crying because of the story of the creation of Turtle Island. I certainly found the rest of the book more soothing than that.\nI wanted to highlight an early quote on sweetgrass from the book that was a perfect preface to the experience I was about to have with the book itself and that I wonder if many of you also had.\n\n“Breathe in its scent and you start to remember things you didn’t know you’d forgotten”\n\n— Robin Wall Kimmerer\n\nThis book reminded me of so many things I hadn’t realized I’d forgotten and through stories connected my heart back up and not just my head. 15 months into a pandemic, in a new city I only moved to 18 months ago, I needed to connect back to life writ larger than just human life, to cycles of reciprocity and gratitude instead of news cycles. This book helped put my feet back on a path towards a balance I’ve been dearly missing.\nIf these were some of the things you connected with to, I’d especially encourage you to learn more about the Dish With One Spoon agreement, as living here we are all invited to this treaty and in it you’ll see much of what you may have found you’d forgotten when reading this book.\n—  Liza\nResources\nU of T\nReconciliation: Walking the Path of Indigenous Allyship June 30, 1:00-2:30 p.m. ET\nThis workshop is run regularly, and is a good ‘101’ session. Keep and eye out for it!\n\nLand Acknowledgement (for U of T)\nLand acknowledgement workshops (TATP options)\nI can’t see when the next of these is planned, but it came highly recommended by my Head TA Becca Christensen. She opened our first TA trainings with a land acknowledgement.\n\nFaculty of Arts and Science links\nIndigenous Data Sovreignty\nAotearoa New Zealand Data Sovereignty group: https://www.temanararaunga.maori.nz/\nResearch Data Management: Indigenous Data Sovereignty (and OCAP® Ownership, Control Access, Possession) https://libguides.usask.ca/RDM/IndigenousDataSovereignty\nOCAP trainings https://fnigc.ca/ocap-training/\n\nI’m still learning a lot about the Canadian context, but there is definitely a lot happening here!\nDish With One Spoon\nScroll down for a ~10 min video: https://facingcanada.facinghistory.org/the-dish-with-one-spoon-wampum\nMore books\nSettler: Identity and colonialism in 21st century Canada by Emma Battell Lowman and Adam J. Barker\n21 Things You May Not Know About the Indian Act by Bob Joseph\nTwitter\nSpend too much time on Twitter, crying at 3:00 a.m.? Or maybe at other times of day too?\nThis list is obviously so woefully not comprehensive, but maybe just think of it as a prompt. How are you seeking out and listening to Indigenous voices?\nBob Joseph, author @wewap\nRobyn Rowe, health research & indigenous data sovereignty @RobynKRowe\nDr. Desi Small-Rodriguez, Assistant Professor of Sociology and American Indian Studies, UCLA @native4data\nCBC Indigenous [@CBCIndigenous](https://twitter.com/CBCIndigenous_\n‘Meet some of the influencers of #NativeTwitter’ https://www.cbc.ca/news/indigenous/indigenous-nativetwitter-influencers-1.4824534\n\nOther\nTeaching by the Medicine Wheel https://www.edcan.ca/articles/teaching-by-the-medicine-wheel/\nAn Antidote to Dissatisfaction (spoiler: gratitude) https://www.youtube.com/watch?v=WPPPFqsECz0\nhttps://www.whose.land/en/\nThanks\nThanks for inviting me, Rohan! And thank you to Paul for hosting.\nIf you are somehow reading this and don’t know Rohan, go fix that:\n rohanalexander.com &  @RohanAlexander\n\n\n\n",
    "preview": "posts/2021-06-16-braiding-sweetgrass/images/braiding-sweetgrass.jpeg",
    "last_modified": "2021-09-25T23:07:15-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-07_ssc2021/",
    "title": "My first Statistical Society of Canada Annual Meeting",
    "description": "Notes and links from SSC2021. I often find I get the most from conferences if I take notes with the vague notion of sharing them. So this is mostly for me, but I hope it might be of interest to others, too. Note: This post will be updated sporadically.",
    "author": [
      {
        "name": "Liza Bolton",
        "url": {}
      }
    ],
    "date": "2021-06-07",
    "categories": [
      "conferences",
      "stats-ed"
    ],
    "contents": "\n\nContents\nTalks you should go to (very biased recommendations)\nIndependent Summer Statistics Community (ISSC): Building a sustainable online undergraduate student community with Cocurricular Activities and Experiential Learning Opportunities\nThe Development and Implementation of a Toolkit for Learning R at all Levels.\n\nTalk notes\nInvited Presidential Address: Probability, Statistics, and Murder\nData privacy in official statistics (Panel Session)\nmverse: An R Library for Teaching and Conducting Multiverse Analysis\nIndependent Summer Statistics Community (ISSC): Building a sustainable online undergraduate student community with Cocurricular Activities and Experiential Learning Opportunities\nOnline Homework Impact in an Introductory Statistics Course\nTactile Response Experimental Analysis Toolkit (TREAT)\nQ&A for Statistical Education 2 session\nCautiously Constructing Charts\nThe Case Against Explainable Artificial Intelligence and Machine Learning\nCloser Than They Appear: A Bayesian Perspective On Individual-Level Heterogeneity In Risk Assessment\nOn the Use of Auxiliary Variables in Multilevel Regression and Poststratification\nSurvey Calibration via the Generalized-Method-of-Moments (GMM)\nAn initiative for promoting an inclusive, equitable and diverse environment at SSC\nA Gentle Introduction to the Poisson Process for a Third Year Probability Course\nThe Development and Implementation of a Toolkit for Learning R at all Levels\nDeveloping and Revising the Student Survey of Motivational Attitudes Toward Statistics: Results from a Pilot Study\nUsing a “Midterm Warning System” to Improve Student Performance and Engagement in an Introductory Statistics Course: An ongoing RCT Study\nData Science and Analytics Section Workshop\n\nReading list\nBooks\nArticles\n\n\n\n\n\nFigure 1: SSC 2021 Conference banner. Image description: Map of Canada with pink to red gradient from west to east on a black background. Test in top right says 2021 Annual Meeting - Virtual in English and French. All on black background.\n\n\n\n My SSC profile\nTalks you should go to (very biased recommendations)\nIndependent Summer Statistics Community (ISSC): Building a sustainable online undergraduate student community with Cocurricular Activities and Experiential Learning Opportunities\n 1:45 PM - 2:00 PM EDT on Monday, June 7\n Event link\n Nathalie Moon\nAbstract\nIn response to disruptions to our students’ plans due to COVID-19 and widespread feelings of isolation, we built a virtual community to help our students build portfolios, meet peers, and explore careers. In all, over 700 students in our programs signed up, and among the 164 students who responded to our end-of-summer survey, 41% were active and 48% passive participants; our data suggests that even passive participation was beneficial in making students feel more connected. As part of the ISSC, we held formal and informal data science workshops, social events, and career-building activities culminating in a DataFest COVID-19 Virtual Challenge. In all, 92 eligible teams applied to participate in DataFest, 62 were invited to compete, and 42 submitted complete submissions. In this talk, we will outline the principles guiding how the ISSC was structured including practical advice and tips for building a sustainable community, lessons learned, and plans for 2021.\nRésumé\nEn réponse aux perturbations des plans des élèves en raison de la COVID-19 et au sentiment d’isolement généralisé, nous avons créé une communauté virtuelle pour aider les étudiants à monter leur portfolio, à rencontrer leurs pairs et à découvrir des carrières. En tout, plus de 700 étudiants se sont inscrits à nos programmes et, parmi les 164 étudiants qui ont répondu à notre enquête de fin d’été, 41 % étaient des participants actifs et 48 % des participants passifs. Nos données suggèrent que même la participation passive a été bénéfique en donnant aux étudiants le sentiment d’être plus connectés. Dans le cadre de la Communauté statistique indépendante d’été, nous avons organisé des ateliers formels et informels sur les sciences des données, des événements sociaux et des activités de développement de carrière, qui ont débouché au défi virtuel des données DataFest COVID-19. Au total, 92 équipes admissibles ont posé leur candidature pour participer à ce défi, 62 ont été invitées à concourir et 42 ont soumis des dossiers complets. Dans cet exposé, nous présenterons les principes qui ont guidé la structure de la Communauté statistique indépendante d’été, les conseils pratiques et les astuces qui ont contribué à créer une communauté durable, ainsi que les leçons apprises et nos plans pour 2021.\nThe Development and Implementation of a Toolkit for Learning R at all Levels.\n 3:45 PM - 4:00 PM EDT on Wednesday, June 9\n Event link\n Samantha-Jo Caetano\nAbstract\nStatistics and data science have become ubiquitous in the hard and social sciences. When working with large data or complex methodology it is crucial that the data analysts are able to program. R is a statistical programming language that is free and popular in the statistics community. R works well for data visualizations, wrangling and employing simple to complex methodology. As educators in statistics we noticed a variation of programming backgrounds in our senior students. Our team of 7 undergraduate students, 2 graduate students, and 2 assistant professors have developed a toolkit to help students improve their programming in R. The toolkit is a set of interactive modules that students complete autonomously. The modules start from the very basics of installing R to tidyverse to employing Bayesian methods. In this talk, we will outline the development and uses of this toolkit, and highlight some next steps.\nRésumé\nLes statistiques et les sciences des données sont devenues omniprésentes dans les sciences dures et humaines. En travaillant avec des données volumineuses ou des méthodologies complexes, il est primordial que les analystes de données soient capables de programmer. R est un langage de programmation gratuit et populaire au sein de la communauté statistique. Il fonctionne à merveille pour les visualisations de données, leur préparation préalable et l’adoption de méthodologies simples ou complexes. En tant qu’éducateurs en statistique, nous avons remarqué que les formations en programmation varient parmi nos étudiants de cycle supérieur. Notre équipe de sept étudiants de premier cycle, deux étudiants de cycle supérieur et deux professeurs assistants ont conçu une boîte à outils afin d’aider les étudiants à rehausser leurs aptitudes de programmation en R. La boîte à outils est composée d’un ensemble de modules interactifs que les étudiants terminent de façon autonome. Les modules commencent par la base de l’installation de R, puis progressent vers tidyverse jusqu’à l’emploi de méthodes bayésiennes. Lors de cet exposé, nous décrirons les grandes lignes du développement et de l’utilisation de cette boîte à outils, et soulignerons les étapes à venir.\nTalk notes\nNotes and reflections of varying quality from the talks I attended + resources shared.\nNote: If I’ve written about talk and there is anything you’d like me to correct or add, please just let me know! Twitter/email links in the navigation bar.\nInvited Presidential Address: Probability, Statistics, and Murder\n Jeffrey Rosenthal,  @ProbabilityProf\nJeff took us on a journey through his experiences with media and especially as an expert witness in court cases. There are a mish-mash of links below and much more on his website: http://probability.ca.\nAn example of a case that was especially interesting/surprising was when he was an expert witness in a case about a marijuana grow-op. This story was really neat because significant jail time rests on whether or not the number of plants was more or less than 500. More than 500 leads to a mandatory three-year jail term.\nThe level of aggressive attacks you end up facing as a expert witness sounds extremely off-putting! I’m glad Jeff’s skin is think enough to go out and do this kind of work, because mine certainly is not.\nSome of Jeff’s final notes and advice:\nStatisticians are nicer, especially Canadian ones.\nBe cautious about what consulting work you agree to, especially in an adversarial context.\nYou can get paid a lot. Think about whether you want to you negotiate an hourly or fixed rate.\nThere are lots of satisfying/important aspects, but also lots of annoying/unpleasant ones, too.\n“If we statisticians don’t do it, then who will?”\nLinks\nHere are several links that were referred to during that talk or shared in chat. (Not exhaustive.)\nLottery link: http://probability.ca/lotteryscandal/\nAnnals Quadfecta: https://imstat.org/2021/05/14/the-annals-quadfecta-23/\nJeff’s Canadian Supreme Court opinion writing article: http://probability.ca/jeff/ftpdir/SCC_UTLJ.pdf\nDiscussion of SIDS/SUDI case history: https://en.wikipedia.org/wiki/Sally_Clark\n“The Clark case has its Aussie version that continues as Jeff speaks.” - Grace Chiu https://www.seattletimes.com/seattle-news/health/australian-mom-convicted-of-killing-4-children-seeks-pardon/\n\nwww.probability.ca/justice\nData privacy in official statistics (Panel Session)\n Donald Estep, Canadian Statistical Sciences Institute and Simon Fraser University,  @donestep1\n Natalie Shlomo, University of Manchester\n John Eltinge, US Census Bureau\n Anne-Sophie Charest, Université Laval\n Pierre Desrochers, Statistics Canada\nPeople don necessarily understand what their own views on disclosure/privacy look like mathematically.\nWhat is inference vs what is disclosure.\nUniqueness: if you publish something that is unique to one person, that is disclosure and that is fairly well agreed upon. BUT, what about as is scales up? What features makes these different, in context?\nWhat ‘privacy’ is interpreted as is context dependent, and expressed through jurisdictional law.\nSynthetic data generates new data by random draws from predictive models.\nDifferential privacy is a “perturbation tool”, a way to add noise/misclassify probabilistically.\nA wider ethical consider in this area is the question of which predictions are intrusions in unacceptable ways. This is more of an ethical/philosophical. When should we not make inferences?\nHow can we learn from others who have been doing risk communication (e.g., around health) to improve our own practices in official statistics\nMy background is using official statistics for social and health research in Aotearoa New Zealand, so it was excellent to dip a toe back into this world and hear about the context here.\nBig thanks to CANSSI for supporting this panel.  @CANSSIINCASS\nLinks\nDuncan, George & Keller-McNulty, Sallie & Stokes, Lynne. (2001). Disclosure Risk vs. Data Utility: The RU Confidentiality Map. https://www.researchgate.net/publication/245939728_Disclosure_Risk_vs_Data_Utility_The_RU_Confidentiality_Map\nKaloskampis. (2019). Synthetic data for public good. https://datasciencecampus.ons.gov.uk/projects/synthetic-data-for-public-good/\nNear, Darais & Boeckl. (2020). Differential Privacy for Privacy-Preserving Data Analysis: An Introduction to our Blog Series. https://www.nist.gov/blogs/cybersecurity-insights/differential-privacy-privacy-preserving-data-analysis-introduction-our\nmverse: An R Library for Teaching and Conducting Multiverse Analysis\n Michael Moon, University of Toronto,  @micbonmoon\nMotivating example, you’ll get different conclusions based on the choice to keep or remove an outlier when investigating hurricane names and people’s response (question: do people take hurricane’s less seriously if they have a feminine name?).\nFamiliar verbs from dplyr, removes need to do a bunch of error prone copy and pasting (systematic).\nInteractive modules are being developed by the team. Great demo of a Shiny app for playing with the hurricane data.\nSubmitting to CRAN sometime this summer.\nGreat presentation from Michael, and I’m super excited about playing with this package!\nLinks\nSlides: http://www.utstat.utoronto.ca/~moon/mverse-ssc21/#1\nPackage on GitHub: https://github.com/mverseanalysis/mverse\nSteegen S, Tuerlinckx F, Gelman A, Vanpaemel W. Increasing Transparency Through a Multiverse Analysis. Perspectives on Psychological Science. 2016;11(5):702-712. doi:10.1177/1745691616658637 https://journals.sagepub.com/doi/10.1177/1745691616658637\nIndependent Summer Statistics Community (ISSC): Building a sustainable online undergraduate student community with Cocurricular Activities and Experiential Learning Opportunities\n Nathalie Moon, University of Toronto\nI was part of the ISSC team, so not notes, other than I think Nathalie did a fab job explaining it.\nUnofficial list of Canadian universities doing ASA DataFest: U of T, UBC, Waterloo, MacEwan/University of Alberta — we should all be friends!\nLinks\nSlides (pdf)\n2020 TidyTuesday activities on GitHub: https://github.com/elb0/ISSC\nOnline Homework Impact in an Introductory Statistics Course\n Tharshanna Nadarajah, University of Toronto\nNeat intro to MyOpenMath advantages and how Tharshanna has used it in teaching, student response and outcomes.\nLinks\nMyOpenMath: https://www.myopenmath.com\nTactile Response Experimental Analysis Toolkit (TREAT)\n Sohee Kang, University of Toronto\nSome lovely data collection activities that students can do in class from a phone or computer. Love this from the abstract: “Students often feel disengaged with data that they do not perceive as being”real\" or “authentic”, and it is important that they believe that the data they are analyzing is representative of real-world problems.\"\nLinks\nMovement breaks that can be used in experiments https://ocw.utoronto.ca/movement-breaks/\nQ&A for Statistical Education 2 session\nLot’s of support for using Slack, though size/licensing can be challenging in large courses or with institution policy. Used for the Independent Summer Statistics Community and TA management by some courses at U of T.\nCourse emails are extremely helpful! E.g., sta303@utoronto.ca. Add a communication policy to your syllabus about where to go for what. We say course email is only for personal/private matters and everything else should be done via Piazza, e.g., “How many pages should this assignment be?”, “What’s a likelihood ratio test?” etc.\nCautiously Constructing Charts\n Michael Correll, Tableau\n“We’re just making bar charts, what’s ethically laden about that!” *sarcasm intensifies*\nTypes of bad visualizations: deceptive, fragile, bullshit 1, evil\nLoved the example of the when bar charts should start at 0, but how this ‘rule’ is a major issue when you try to show line graphs of global temperature and demonstrate the serious increases.\nSo, when IS it okay to truncate the y-axis? The camps Michael identifies are: the anathemists, the line chart exceptionists, the signalers (be really explicit about truncation!). The things is, there hasn’t really be testing of effectiveness in any of this.\nFurther research suggests that rule following isn’t going to cut it! The context of the charts AND the intent are very important.\n\nThere are multiple places in the pipeline where things can go wrong, but this means there are places for us to intervene!\nThe environment is curated to data which is wrangled to prepared data which is visualized to get an image and that image is read by someone to get a message. (Michael has a nice image to go with this in his slides.)\n\nAny human-computer interaction assistance project eventually just becomes Clippy.\nLinks\nhttps://accidental-art.tumblr.com/\nFrankfurt. (1986). On bullshit. http://www2.csudh.edu/ccauthen/576f12/frankfurt__harry_-_on_bullshit.pdf\nMcNutt, Kindlmannn & Correll. (2020). Surfacing Visualization Mirages https://arxiv.org/abs/2001.02316\nCorrell. (2018). Ethical Dimensions of Visualization Research. https://arxiv.org/pdf/1811.07271.pdf ) if that helps.\nThe Case Against Explainable Artificial Intelligence and Machine Learning\n Boris Babic, INSEAD but soon to be U of T\nWhite box (like a good ol’ GLM that is easy for a human to understand) vs a black box (e.g., deep learning models), but of course there is lots of potential for grey boxes, like how many parameters is too many? What about level of understanding of the user?\nExplainable vs interprettable\n‘Ersatz understanding’: in law/philosophy the idea of understanding is based in the ‘why’ between input and output.\nWhy isn’t this genuine understanding? Example given of post-hoc judge’s assistant noticing a pattern and saying that is why a decision was made for denying parole, when really there could be other reasons. The assistant is the white box approximation, but the judge is the black box. ‘Pseudo-understanding’.\n\nWe want explainable systems because this is tied to our ideas around accountability and trust.\nWe also want robustness (e.g., we’d expect similar advice for similar patients in a health context). White box approximations can give us a sense of ocal faithfulness but the potential to produce super different outcomes.\nIn summary, the main issues are pseudo/ersatz understanding—we have a false impression that we do understand what the black box is doing, the potential for non-stability when trying to use approximations, and the challenges due to existing issues with statistical literacy of data product users. Assumptions about causality, etc.\nLinks\nThanks to Jim Stallard for recommending Data Visualization: Charts, Maps, and Interactive Graphics by Robert Grant https://www.goodreads.com/book/show/40684954-data-visualization\nBoris and collaborators have a paper coming out in this topic. Keep an eye on his website: https://borisbabic.com/research/\nCloser Than They Appear: A Bayesian Perspective On Individual-Level Heterogeneity In Risk Assessment\n Kristian Lum, UPenn,  @KLDivergence\nKristian is so cool and I love any and every opportunity to hear her speak!\nThis presentation is introducing a new project around failure-to-appear in criminal processes.\nFAT/FACT/FATE (algorithmic fairness acronyms)\nThere are differences between ideas of GROUP fairness and INDIVIDUAL fairness (“people who are similar should be treated similarly”). Kristian found that this was already being discussed in the risk assessment literature but in a different way. Group probabilities and uncertainty around group-wise rates.\n“People are certainly more than the weighted sum of their covariates”\nWe tend to have to make the assumption, if we’re only observing each person once, that their individual probability will be approximated by the group probability. This feels naughty.\nWhat about when you DO have multiple observations per person? Well, it allows us to “take seriously” the idea that each person should only be judged on their own actions. When using group probabilities, you are being ‘judged’ through the actions of others.\nIn this project they are looking at using Bayesian random effects distributions and testing with a large Kentucky dataset. This tends to show us that we’re in the ‘large variance’ situation where people are not closely grouped around their group mean.\nRisk assessments affect the trajectory of real people’s lives.\nLinks\nAngwin, Larson, Mattu & Lauren Kirchner. (2016). ProPublica. Machine Bias. https://www.propublica.org/article/machine-bias-risk-assessments-in-criminal-sentencing\nOn the Use of Auxiliary Variables in Multilevel Regression and Poststratification\n Yajuan Si, University of Michigan,  @yajuansi\nMRP (“mister P”) is multilevel regression (MR) and poststratification (P)\n“A model-based perspective of poststratification”, Gelman and motivated by Little (1993)\nProposed as a combo of modelling and design.\nRooted in survey research but also modelling and has strong assumption, reliance on auxillary variables.\nFewer auxiliary, the better BUT it may violate conditional independence assumptions about cells. When constructing cells should use variables highly correlated with the outcome.\n“Shrinking from both sides”.\n\n\n\nFigure 2: List of papers about MRP authored by Si and colleagues\n\n\n\nLinks\nLittle. (1993). Post-Stratification: A Modeler’s Perspective. https://escholarship.org/uc/item/4np24519\nSee list of papers above\nSurvey Calibration via the Generalized-Method-of-Moments (GMM)\n Heng Chen, Bank of Canada\nMotivation: reports that people were concerned about transmission of COVID-19 via cash.\nConsumer surveys to understand how people were using cash in response to the pandemic. April, July and November 2020. Interested in changes between first and second waves.\nThree main variables of interest: Cash on hand, what proportion of people are using cash, what proportion of people plan to go cashless.\nHave repeated cross-sections and longitudinal data.\nFor cross-sectional data, considering propensity score, selection into surveys. Then can condition on Y on selection in to the given survey. Compare \\(Y_1 | S_I\\) with \\(Y_2|S_2\\)\nFor longitudinal, there is another ‘propensity’, that is to stay in both surveys, as well as the selction into the two survey waves.\n“covariate balancing”, propensity scoring has two jobs: modelling the choice and balance between weighted sample and unbiased targets. The weight (with the PS) is what helps up balance the observed value to the unbiased target.\nAdvantages of covariate balancing propensity scores: calibrated weights dual problem, “robust to (parametric) misspecification”, can use GMM (stacking moments to get other parameters), flexible about the unbiased targets.\nFirst, choose the covariates for the PS - they will be your denominator for the moment calculation. Second, get functional forms for the propensity scores for the selection into each survey and attrition measure (for longitudinal).\nResults for the cash research: Some decrease in cash on hand, but increase in having used cash and\nLinks\nChen et al. (2020). Cash and COVID-19: The impact of the pandemic on demand for and use of cash. https://www.bankofcanada.ca/wp-content/uploads/2020/07/sdp2020-6.pdf\nAn initiative for promoting an inclusive, equitable and diverse environment at SSC\nNothing specific to say other than how glad I am that SSC and NSERC and CANSSI and partner institutions are committed to improving EDI.\n Folks to follow: @BouchraNasri, @donestep1, @statacake, @alejandroadem\nA Gentle Introduction to the Poisson Process for a Third Year Probability Course\n Lengyi Han, UBC\nHan proposes that the usual ways of introducing Poisson processes and notation can be quite difficult for students, especially to connect to real world examples.\nMotivation with a Bernoulli process example (arrivals at a bank)\nSuppose we divide the time in question (say 60 minutes) into equal sub-intervals and a person can only arrive at the midpoint of a sub-interval.\nIf we make finer and finer sub-intervals we show that the Poisson and Bernoulli process will be approximately the same for sufficiently large \\(n\\).\nAfter the above, reiterate the assumptions and conditions for a Bernoulli process. From here, students can see that as the interval width tends to 0, we get the Poisson dist.\nSpecifically, the Bernoulli procress avoids the use of \\(o(h)\\) notation and student work through the derivation, motivating the use of this notation as helpful instead of obscure.\nUse Taylor expansion\n\nLinks\nLawerence Leemis on YouTube https://www.youtube.com/channel/UCoXVQ0xV2VOk3XrREv5061w\nThe Development and Implementation of a Toolkit for Learning R at all Levels\n Sam Caetano (presenting), University of Toronto  @StatisticalSam\n Also check out: @RohanAlexander, @michaelycchong, @pailfodgetts\nThis was an awesome example of a large team education innovation project! 2 faculty leads, 2 graduate students and 8 undergraduate students (+support from the department)\nStudents learned a lot about GitHub and collaboration as part of their RA roles.\nThere are introductions for complete beginners and it is also very ‘jump-in-able’ for folks who are already some of the way there.\nSuggested implementation: could have quiz questions in class quizzes related to the\nLinks\nToolkit home page: https://dosstoolkit.com/\nRead the paper! https://arxiv.org/abs/2105.09347\nlearnr package is great for creating interactive tutorials: https://rstudio.github.io/learnr/\nDeveloping and Revising the Student Survey of Motivational Attitudes Toward Statistics: Results from a Pilot Study\n Douglas Whitaker, Mount Saint Vincent University  @DouglasWhitaker\nS-SOMAS: Student Survey of MOtivational Attitude toward Statistics\nOne of family of 6 instruments. 2 x topics (statistics, data science) across 3 x types (student, instructor and environment)\nMASDER: Motivational Attitudes in Statistics and Data Science Education Research team\n“Expectancy-Value Theory”: achievement-related choices and performance are affected by what you value and what you expect to happen. EVERYTHING else operate through one or both of these.\nUse PCA, check the loadings/dimensionality before item response theory.\nExample given of ‘who can do stats’ vs ‘overall difficulty’ on the ‘difficult’ scale. The two ‘who can do’ items looks different to the others.\nSaw some substantial misfit\neRm package (Mair et al., 2021), mirt package (Chalmers, 2012) for generalized partial credit.\n\nI’m looking forward to seeing how these tools develop!\nUsing a “Midterm Warning System” to Improve Student Performance and Engagement in an Introductory Statistics Course: An ongoing RCT Study\n Nooshin Rotondi, Ontario Tech University\nBackground: intro stats for health care students, ‘have to’ be there as opposed to choosing statistics\nMeasured demographics, response on scale and performance\nRCT with two groups, intervention (personalized email) vs control (no personalized email, as per standard practice)\nAll resources mentioned in personalized emails had been previously shared with the whole class as part of standard practice.\nLoved this talk! Excited to see next steps.\nLinks\nDeslauriers et al. (2012). Transforming the Lowest-Performing Students: An Intervention That Worked. https://www.sei.ubc.ca/bitstream/seima/2141/1/Harris_Intervention_JCST2012.pdf\nGordanier, Hauk & Sankaran. (2019). Early intervention in college classes and improved student outcomes. https://www.sciencedirect.com/science/article/abs/pii/S0272775718305272\nData Science and Analytics Section Workshop\n Chris Holdgraf, 2i2c.org,  @choldgraf\n\nAn article about computational science in a scientific publication is not the scholarship itself, it is merely advertising of the scholarship. The actual scholarship is the complete software development environment and the complete set of instructions which generated the figures.\n~ Buckheit and Donoho\nWaveLab and Reproducible Research, 1995\n\n“Jupyter and the last mile problem”\n“Jupyter is a community of people and an ecosystem open tools and standard for interactive computing”\nLanguage agnostic: “empower people to use open tools”\nMetaphor of getting you to a coffee shop: walk? pay someone to drive you? use public infrastructure?\nWhat Chris would prefer (for himself and us all) is the public option!\nTake this idea and apply it to creating a great technical report.\n\nThe notebook experience combines a document standard, and environment (R, Python, etc.), and an interface.\nNotebooks are “structured but generic”. The can have many different front ends, for example:'classic’, JupyterLab and nteract.\nJupyterLab is meant to provide a more flexible and customizable space. It is sandalone as a UI, but you can also put components together, Lego-style into the UI you need.\nReal-time collaboration is being worked on!! Still an early prototype, but I am so excited.\nJupyter Book and MyST (pronounced ‘mist’)\nMarkdown is usually not extensible, but MyST lets you set out roles and directives. Can add images and include references.\nWant JupyterHub for a small user base (2-80 people)? The Littlest JupyterHub (tljh.jupyter.org). For larger groups, JupyterHub on Kubernetes.\nData8.org / inferentialthinking.org\nWe’ve been using JupyterHub in teaching at U of T for almost a year now, and it has been working really well. I use it with R and it also allows us to use RStudio which is really nice. Big thanks to Nathan Taback who has been leading this from our side, and to the members of 2i2c.org that have been helping us. Highly recommend.\nI really like Chris’ emphasis on design principles in this talk.\nThe rest of the session was hand on workshops from David Liu, Nathan Taback ( @NathanTaback) and Nathaniel Stevens. https://github.com/ssc-datascience/pythonjupyter_wshop2021 They were really good!\nLinks\nChris Holdgraf’s personal website: https://predictablynoisy.com/\nJupyter https://jupyter.org/ and JupyterHub https://jupyter.org/hub\nhttps://2i2c.org/ (Chris is Director)\nBinder https://mybinder.org/\nJupyterBook for publishing https://jupyterbook.org (like bookdown, cool!)\nGorgeous images from Scriberia about data work: https://zenodo.org/record/3332808\nPangeo https://pangeo.io a community platform for Big Data geoscience\nReading list\nBooks\n Goodreads shelf for SSC2021\nKnock on Wood: Luck, Chance, and the Meaning of Everything by Jeffrey S. Rosenthal https://www.goodreads.com/book/show/36300756-knock-on-wood\nData Visualization: Charts, Maps, and Interactive Graphics by Robert Grant https://www.goodreads.com/book/show/40684954-data-visualization\nArticles\nJeff’s Canadian Supreme Court opinion writing article: http://probability.ca/jeff/ftpdir/SCC_UTLJ.pdf\nKaloskampis. (2019). Synthetic data for public good. https://datasciencecampus.ons.gov.uk/projects/synthetic-data-for-public-good/\nSteegen S, Tuerlinck F, Gelman A, Vanpaemel W. Increasing Transparency Through a Multiverse Analysis. Perspectives on Psychological Science. 2016;11(5):702-712. doi:10.1177/1745691616658637 https://journals.sagepub.com/doi/10.1177/1745691616658637\nMcNutt, Kindlmannn & Correll. (2020). Surfacing Visualization Mirages https://arxiv.org/abs/2001.02316\nCorrell. (2018). Ethical Dimensions of Visualization Research. https://arxiv.org/pdf/1811.07271.pdf ) if that helps.\nDeslauriers et al. (2012). Transforming the Lowest-Performing Students: An Intervention That Worked. https://www.sei.ubc.ca/bitstream/seima/2141/1/Harris_Intervention_JCST2012.pdf\n\nIn the sense of Frankfurt’s On Bullshit http://www2.csudh.edu/ccauthen/576f12/frankfurt__harry_-_on_bullshit.pdf↩︎\n",
    "preview": "posts/2021-06-07_ssc2021/images/SSCDesktopBannerMap.png",
    "last_modified": "2021-09-04T14:39:26-04:00",
    "input_file": {},
    "preview_width": 2560,
    "preview_height": 1170
  }
]
